Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/eth.h
/* -------- ETH_WOL : (ETH Offset: 0x10B8) (R/W 32) Wake on LAN -------- */
#define ETH_WOL_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_WOL) Wake on LAN  Reset Value */

#define ETH_WOL_IP_Pos                        _UINT32_(0)                                          /* (ETH_WOL) IP address Position */
#define ETH_WOL_IP_Msk                        (_UINT32_(0xFFFF) << ETH_WOL_IP_Pos)                 /* (ETH_WOL) IP address Mask */
#define ETH_WOL_IP(value)                     (ETH_WOL_IP_Msk & (_UINT32_(value) << ETH_WOL_IP_Pos)) /* Assigment of value for IP in the ETH_WOL register */
#define ETH_WOL_MAG_Pos                       _UINT32_(16)                                         /* (ETH_WOL) Event enable Position */
#define ETH_WOL_MAG_Msk                       (_UINT32_(0x1) << ETH_WOL_MAG_Pos)                   /* (ETH_WOL) Event enable Mask */
#define ETH_WOL_MAG(value)                    (ETH_WOL_MAG_Msk & (_UINT32_(value) << ETH_WOL_MAG_Pos)) /* Assigment of value for MAG in the ETH_WOL register */
#define ETH_WOL_ARP_Pos                       _UINT32_(17)                                         /* (ETH_WOL) LAN ARP req Position */
#define ETH_WOL_ARP_Msk                       (_UINT32_(0x1) << ETH_WOL_ARP_Pos)                   /* (ETH_WOL) LAN ARP req Mask */
#define ETH_WOL_ARP(value)                    (ETH_WOL_ARP_Msk & (_UINT32_(value) << ETH_WOL_ARP_Pos)) /* Assigment of value for ARP in the ETH_WOL register */
#define ETH_WOL_SA1_Pos                       _UINT32_(18)                                         /* (ETH_WOL) WOL specific address reg 1 Position */
#define ETH_WOL_SA1_Msk                       (_UINT32_(0x1) << ETH_WOL_SA1_Pos)                   /* (ETH_WOL) WOL specific address reg 1 Mask */
#define ETH_WOL_SA1(value)                    (ETH_WOL_SA1_Msk & (_UINT32_(value) << ETH_WOL_SA1_Pos)) /* Assigment of value for SA1 in the ETH_WOL register */
#define ETH_WOL_MTI_Pos                       _UINT32_(19)                                         /* (ETH_WOL) WOL LAN multicast Position */
#define ETH_WOL_MTI_Msk                       (_UINT32_(0x1) << ETH_WOL_MTI_Pos)                   /* (ETH_WOL) WOL LAN multicast Mask */
#define ETH_WOL_MTI(value)                    (ETH_WOL_MTI_Msk & (_UINT32_(value) << ETH_WOL_MTI_Pos)) /* Assigment of value for MTI in the ETH_WOL register */
#define ETH_WOL_Msk                           _UINT32_(0x000FFFFF)                                 /* (ETH_WOL) Register Mask  */

#define ETH_WOL_SA_Pos                        _UINT32_(18)                                         /* (ETH_WOL Position) WOL specific address reg x */
#define ETH_WOL_SA_Msk                        (_UINT32_(0x1) << ETH_WOL_SA_Pos)                    /* (ETH_WOL Mask) SA */
#define ETH_WOL_SA(value)                     (ETH_WOL_SA_Msk & (_UINT32_(value) << ETH_WOL_SA_Pos)) 

/* -------- ETH_IPGS : (ETH Offset: 0x10BC) (R/W 32) IPG Stretch Register -------- */
#define ETH_IPGS_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_IPGS) IPG Stretch Register  Reset Value */

#define ETH_IPGS_FL_Pos                       _UINT32_(0)                                          /* (ETH_IPGS) Frame Length Position */
#define ETH_IPGS_FL_Msk                       (_UINT32_(0xFFFF) << ETH_IPGS_FL_Pos)                /* (ETH_IPGS) Frame Length Mask */
#define ETH_IPGS_FL(value)                    (ETH_IPGS_FL_Msk & (_UINT32_(value) << ETH_IPGS_FL_Pos)) /* Assigment of value for FL in the ETH_IPGS register */
#define ETH_IPGS_Msk                          _UINT32_(0x0000FFFF)                                 /* (ETH_IPGS) Register Mask  */


/* -------- ETH_SVLAN : (ETH Offset: 0x10C0) (R/W 32) Stacked VLAN Register -------- */
#define ETH_SVLAN_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SVLAN) Stacked VLAN Register  Reset Value */

#define ETH_SVLAN_VLAN_TYPE_Pos               _UINT32_(0)                                          /* (ETH_SVLAN) User Defined VLAN_TYPE Field Position */
#define ETH_SVLAN_VLAN_TYPE_Msk               (_UINT32_(0xFFFF) << ETH_SVLAN_VLAN_TYPE_Pos)        /* (ETH_SVLAN) User Defined VLAN_TYPE Field Mask */
#define ETH_SVLAN_VLAN_TYPE(value)            (ETH_SVLAN_VLAN_TYPE_Msk & (_UINT32_(value) << ETH_SVLAN_VLAN_TYPE_Pos)) /* Assigment of value for VLAN_TYPE in the ETH_SVLAN register */
#define ETH_SVLAN_ESVLAN_Pos                  _UINT32_(31)                                         /* (ETH_SVLAN) Enable Stacked VLAN Processing Mode Position */
#define ETH_SVLAN_ESVLAN_Msk                  (_UINT32_(0x1) << ETH_SVLAN_ESVLAN_Pos)              /* (ETH_SVLAN) Enable Stacked VLAN Processing Mode Mask */
#define ETH_SVLAN_ESVLAN(value)               (ETH_SVLAN_ESVLAN_Msk & (_UINT32_(value) << ETH_SVLAN_ESVLAN_Pos)) /* Assigment of value for ESVLAN in the ETH_SVLAN register */
#define ETH_SVLAN_Msk                         _UINT32_(0x8000FFFF)                                 /* (ETH_SVLAN) Register Mask  */


/* -------- ETH_TPFCP : (ETH Offset: 0x10C4) (R/W 32) Transmit PFC Pause Register -------- */
#define ETH_TPFCP_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_TPFCP) Transmit PFC Pause Register  Reset Value */

#define ETH_TPFCP_PEV_Pos                     _UINT32_(0)                                          /* (ETH_TPFCP) Priority Enable Vector Position */
#define ETH_TPFCP_PEV_Msk                     (_UINT32_(0xFF) << ETH_TPFCP_PEV_Pos)                /* (ETH_TPFCP) Priority Enable Vector Mask */
#define ETH_TPFCP_PEV(value)                  (ETH_TPFCP_PEV_Msk & (_UINT32_(value) << ETH_TPFCP_PEV_Pos)) /* Assigment of value for PEV in the ETH_TPFCP register */
#define ETH_TPFCP_PQ_Pos                      _UINT32_(8)                                          /* (ETH_TPFCP) Pause Quantum Position */
#define ETH_TPFCP_PQ_Msk                      (_UINT32_(0xFF) << ETH_TPFCP_PQ_Pos)                 /* (ETH_TPFCP) Pause Quantum Mask */
#define ETH_TPFCP_PQ(value)                   (ETH_TPFCP_PQ_Msk & (_UINT32_(value) << ETH_TPFCP_PQ_Pos)) /* Assigment of value for PQ in the ETH_TPFCP register */
#define ETH_TPFCP_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_TPFCP) Register Mask  */


/* -------- ETH_SAMB1 : (ETH Offset: 0x10C8) (R/W 32) Specific Address 1 Mask Bottom [31:0] Register -------- */
#define ETH_SAMB1_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SAMB1) Specific Address 1 Mask Bottom [31:0] Register  Reset Value */

#define ETH_SAMB1_ADDR_Pos                    _UINT32_(0)                                          /* (ETH_SAMB1) Specific Address 1 Mask Position */
#define ETH_SAMB1_ADDR_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_SAMB1_ADDR_Pos)         /* (ETH_SAMB1) Specific Address 1 Mask Mask */
#define ETH_SAMB1_ADDR(value)                 (ETH_SAMB1_ADDR_Msk & (_UINT32_(value) << ETH_SAMB1_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAMB1 register */
#define ETH_SAMB1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_SAMB1) Register Mask  */


/* -------- ETH_SAMT1 : (ETH Offset: 0x10CC) (R/W 32) Specific Address 1 Mask Top [47:32] Register -------- */
#define ETH_SAMT1_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SAMT1) Specific Address 1 Mask Top [47:32] Register  Reset Value */

#define ETH_SAMT1_ADDR_Pos                    _UINT32_(0)                                          /* (ETH_SAMT1) Specific Address 1 Mask Position */
#define ETH_SAMT1_ADDR_Msk                    (_UINT32_(0xFFFF) << ETH_SAMT1_ADDR_Pos)             /* (ETH_SAMT1) Specific Address 1 Mask Mask */
#define ETH_SAMT1_ADDR(value)                 (ETH_SAMT1_ADDR_Msk & (_UINT32_(value) << ETH_SAMT1_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAMT1 register */
#define ETH_SAMT1_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_SAMT1) Register Mask  */


/* -------- ETH_NSC : (ETH Offset: 0x10DC) (R/W 32) Tsu timer comparison nanoseconds Register -------- */
#define ETH_NSC_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_NSC) Tsu timer comparison nanoseconds Register  Reset Value */

#define ETH_NSC_NANOSEC_Pos                   _UINT32_(0)                                          /* (ETH_NSC) 1588 Timer Nanosecond comparison value Position */
#define ETH_NSC_NANOSEC_Msk                   (_UINT32_(0x1FFFFF) << ETH_NSC_NANOSEC_Pos)          /* (ETH_NSC) 1588 Timer Nanosecond comparison value Mask */
#define ETH_NSC_NANOSEC(value)                (ETH_NSC_NANOSEC_Msk & (_UINT32_(value) << ETH_NSC_NANOSEC_Pos)) /* Assigment of value for NANOSEC in the ETH_NSC register */
#define ETH_NSC_Msk                           _UINT32_(0x001FFFFF)                                 /* (ETH_NSC) Register Mask  */


