Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/eth.h
/* -------- ETH_JR : (ETH Offset: 0x118C) ( R/ 32) Jabbers Received Register -------- */
#define ETH_JR_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_JR) Jabbers Received Register  Reset Value */

#define ETH_JR_JRX_Pos                        _UINT32_(0)                                          /* (ETH_JR) Jabbers Received Position */
#define ETH_JR_JRX_Msk                        (_UINT32_(0x3FF) << ETH_JR_JRX_Pos)                  /* (ETH_JR) Jabbers Received Mask */
#define ETH_JR_JRX(value)                     (ETH_JR_JRX_Msk & (_UINT32_(value) << ETH_JR_JRX_Pos)) /* Assigment of value for JRX in the ETH_JR register */
#define ETH_JR_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_JR) Register Mask  */


/* -------- ETH_FCSE : (ETH Offset: 0x1190) ( R/ 32) Frame Check Sequence Errors Register -------- */
#define ETH_FCSE_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_FCSE) Frame Check Sequence Errors Register  Reset Value */

#define ETH_FCSE_FCKR_Pos                     _UINT32_(0)                                          /* (ETH_FCSE) Frame Check Sequence Errors Position */
#define ETH_FCSE_FCKR_Msk                     (_UINT32_(0x3FF) << ETH_FCSE_FCKR_Pos)               /* (ETH_FCSE) Frame Check Sequence Errors Mask */
#define ETH_FCSE_FCKR(value)                  (ETH_FCSE_FCKR_Msk & (_UINT32_(value) << ETH_FCSE_FCKR_Pos)) /* Assigment of value for FCKR in the ETH_FCSE register */
#define ETH_FCSE_Msk                          _UINT32_(0x000003FF)                                 /* (ETH_FCSE) Register Mask  */


/* -------- ETH_LFFE : (ETH Offset: 0x1194) ( R/ 32) Length Field Frame Errors Register -------- */
#define ETH_LFFE_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_LFFE) Length Field Frame Errors Register  Reset Value */

#define ETH_LFFE_LFER_Pos                     _UINT32_(0)                                          /* (ETH_LFFE) Length Field Frame Errors Position */
#define ETH_LFFE_LFER_Msk                     (_UINT32_(0x3FF) << ETH_LFFE_LFER_Pos)               /* (ETH_LFFE) Length Field Frame Errors Mask */
#define ETH_LFFE_LFER(value)                  (ETH_LFFE_LFER_Msk & (_UINT32_(value) << ETH_LFFE_LFER_Pos)) /* Assigment of value for LFER in the ETH_LFFE register */
#define ETH_LFFE_Msk                          _UINT32_(0x000003FF)                                 /* (ETH_LFFE) Register Mask  */


/* -------- ETH_RSE : (ETH Offset: 0x1198) ( R/ 32) Receive Symbol Errors Register -------- */
#define ETH_RSE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RSE) Receive Symbol Errors Register  Reset Value */

#define ETH_RSE_RXSE_Pos                      _UINT32_(0)                                          /* (ETH_RSE) Receive Symbol Errors Position */
#define ETH_RSE_RXSE_Msk                      (_UINT32_(0x3FF) << ETH_RSE_RXSE_Pos)                /* (ETH_RSE) Receive Symbol Errors Mask */
#define ETH_RSE_RXSE(value)                   (ETH_RSE_RXSE_Msk & (_UINT32_(value) << ETH_RSE_RXSE_Pos)) /* Assigment of value for RXSE in the ETH_RSE register */
#define ETH_RSE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_RSE) Register Mask  */


/* -------- ETH_AE : (ETH Offset: 0x119C) ( R/ 32) Alignment Errors Register -------- */
#define ETH_AE_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_AE) Alignment Errors Register  Reset Value */

#define ETH_AE_AER_Pos                        _UINT32_(0)                                          /* (ETH_AE) Alignment Errors Position */
#define ETH_AE_AER_Msk                        (_UINT32_(0x3FF) << ETH_AE_AER_Pos)                  /* (ETH_AE) Alignment Errors Mask */
#define ETH_AE_AER(value)                     (ETH_AE_AER_Msk & (_UINT32_(value) << ETH_AE_AER_Pos)) /* Assigment of value for AER in the ETH_AE register */
#define ETH_AE_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_AE) Register Mask  */


/* -------- ETH_RRE : (ETH Offset: 0x11A0) ( R/ 32) Receive Resource Errors Register -------- */
#define ETH_RRE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RRE) Receive Resource Errors Register  Reset Value */

#define ETH_RRE_RXRER_Pos                     _UINT32_(0)                                          /* (ETH_RRE) Receive Resource Errors Position */
#define ETH_RRE_RXRER_Msk                     (_UINT32_(0x3FFFF) << ETH_RRE_RXRER_Pos)             /* (ETH_RRE) Receive Resource Errors Mask */
#define ETH_RRE_RXRER(value)                  (ETH_RRE_RXRER_Msk & (_UINT32_(value) << ETH_RRE_RXRER_Pos)) /* Assigment of value for RXRER in the ETH_RRE register */
#define ETH_RRE_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_RRE) Register Mask  */


/* -------- ETH_ROE : (ETH Offset: 0x11A4) ( R/ 32) Receive Overrun Register -------- */
#define ETH_ROE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_ROE) Receive Overrun Register  Reset Value */

#define ETH_ROE_RXOVR_Pos                     _UINT32_(0)                                          /* (ETH_ROE) Receive Overruns Position */
#define ETH_ROE_RXOVR_Msk                     (_UINT32_(0x3FF) << ETH_ROE_RXOVR_Pos)               /* (ETH_ROE) Receive Overruns Mask */
#define ETH_ROE_RXOVR(value)                  (ETH_ROE_RXOVR_Msk & (_UINT32_(value) << ETH_ROE_RXOVR_Pos)) /* Assigment of value for RXOVR in the ETH_ROE register */
#define ETH_ROE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_ROE) Register Mask  */


/* -------- ETH_IHCE : (ETH Offset: 0x11A8) ( R/ 32) IP Header Checksum Errors Register -------- */
#define ETH_IHCE_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_IHCE) IP Header Checksum Errors Register  Reset Value */

#define ETH_IHCE_HCKER_Pos                    _UINT32_(0)                                          /* (ETH_IHCE) IP Header Checksum Errors Position */
#define ETH_IHCE_HCKER_Msk                    (_UINT32_(0xFF) << ETH_IHCE_HCKER_Pos)               /* (ETH_IHCE) IP Header Checksum Errors Mask */
#define ETH_IHCE_HCKER(value)                 (ETH_IHCE_HCKER_Msk & (_UINT32_(value) << ETH_IHCE_HCKER_Pos)) /* Assigment of value for HCKER in the ETH_IHCE register */
#define ETH_IHCE_Msk                          _UINT32_(0x000000FF)                                 /* (ETH_IHCE) Register Mask  */


